{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 49], "dtype": "int32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 49], "dtype": "int32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": false, "batch_input_shape": [null, 49], "dtype": "float32", "input_dim": 22697, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 49}, "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 2, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["embedding_1", 0, 0, {}]], [["embedding_1", 1, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s.\u0000\u0000\u0000t\u0000j\u0001t\u0000j\u0002t\u0000j\u0003|\u0000d\u0001\u0019\u0000|\u0000d\u0002\u0019\u0000\u0018\u0000\u0083\u0001d\u0002d\u0003d\u0004\u008d\u0003\u000b\u0000\u0083\u0001}\u0001|\u0001S\u0000)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000T)\u0002\u00da\u0004axis\u00da\bkeepdims)\u0004\u00da\u0001K\u00da\u0003exp\u00da\u0003sum\u00da\u0003abs)\u0002\u00da\u0006vectorr\u0006\u0000\u0000\u0000\u00a9\u0000r\n\u0000\u0000\u0000\u00faOC:/Users/ichida/Google Drive/PUCRS/TCC/semantic-neural-network/modules/model.py\u00da\u001fexponent_neg_manhattan_distance#\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0002*\u0002", null, null], "function_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\u0004\u0000\u0000\u0000d\u0002S\u0000)\u0003N\u00e9\u0001\u0000\u0000\u0000\u00a9\u0002Nr\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0006shapesr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faOC:/Users/ichida/Google Drive/PUCRS/TCC/semantic-neural-network/modules/model.py\u00da\tout_shape \u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_1", 1, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["lambda_1", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}